{
  "column": "age_group",
  "title": "Age Group",
  "type": "string",
  "format": "default",
  "description": "Age group descriptor harmonized across sources ({lower}-{upper}, {lower}-, all-ages, all-specified-ages, all-unspecified-ages). The range descriptors are open on the left and closed on the right. For example, the age_group given by 5-10 includes individuals of age 5 but excludes individuals of age 10.",
  "pattern": "",
  "column.1": "age_grouping_scheme",
  "title.1": "Age Grouping Scheme",
  "type.1": "string",
  "format.1": "default",
  "description.1": "Description of the age grouping scheme within which the age group lies, so that one may identify what sets of age groups can be meaningfully added together. For example, an age grouping scheme could be -- 5-year bins from 0-99+ -- indicating that if all groups in this scheme are added one would obtain the total over all ages.",
  "pattern.1": "",
  "column.2": "age_grouping_total",
  "title.2": "Age Grouping Total",
  "type.2": "string",
  "format.2": "default",
  "description.2": "Value that can be matched against age_group to identify the record containing the total that one should obtain by summing all age groups in their age grouping scheme. This will often be something like -- All Ages -- but it can also be things like -- Under 5 years -- for an age grouping scheme that is yearly for all people under five.",
  "pattern.2": "",
  "column.3": "basal_disease",
  "title.3": "Basal Disease",
  "type.3": "string",
  "format.3": "default",
  "description.3": "Base disease name that encapsulates this disease in a hierarchy of diseases.",
  "pattern.3": "",
  "column.4": "births",
  "title.4": "Births",
  "type.4": "string",
  "format.4": "num_missing",
  "description.4": "Number of births reported for this period as reported by the original source.",
  "pattern.4": "",
  "column.5": "burials",
  "title.5": "Burials",
  "type.5": "string",
  "format.5": "num_missing",
  "description.5": "Number of burials reported for this period as reported by the original source.",
  "pattern.5": "",
  "column.6": "cases_cum_median_prev_5_years",
  "title.6": "Median Cumulative Case Numbers Over the Previous Five Years",
  "type.6": "string",
  "format.6": "num_missing",
  "description.6": "Median number of cumulative cases by this current period, with the median taken over the previous five years -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
  "pattern.6": "",
  "column.7": "cases_cum_prev_year",
  "title.7": "Cumulative Case Numbers for the Previous Year",
  "type.7": "string",
  "format.7": "num_missing",
  "description.7": "Total number of cases up until this current period, in the previous year -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
  "pattern.7": "",
  "column.8": "cases_cum_report_year",
  "title.8": "Cumulative Case Numbers for the Report Year",
  "type.8": "string",
  "format.8": "num_missing",
  "description.8": "Total number of cases up until this current period, in the current year -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
  "pattern.8": "",
  "column.9": "cases_median_prev_5_years",
  "title.9": "Median Weekly Case Numbers Over the Previous Five Years",
  "type.9": "string",
  "format.9": "num_missing",
  "description.9": "Median number of weekly cases in this current period, with the median taken over the previous five years -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
  "pattern.9": "",
  "column.10": "cases_prev_period",
  "title.10": "Case Numbers Reported for the Previous Period",
  "type.10": "string",
  "format.10": "num_missing",
  "description.10": "Number of cases reported for the previous period, at the end of this current period -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
  "pattern.10": "",
  "column.11": "cases_prev_year",
  "title.11": "Case Numbers Reported for the Previous Year",
  "type.11": "string",
  "format.11": "num_missing",
  "description.11": "Number of cases reported for the previous year, at the end of this current period -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
  "pattern.11": "",
  "column.12": "cases_this_period",
  "title.12": "Case Numbers Reported for this Period",
  "type.12": "string",
  "format.12": "num_missing",
  "description.12": "Number of cases reported for this period, at the end of this period -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
  "pattern.12": "",
  "column.13": "cases_two_years_ago",
  "title.13": "Case Numbers Reported Two Years Previous",
  "type.13": "string",
  "format.13": "num_missing",
  "description.13": "Number of cases reported two years previous, at the end of this current period -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
  "pattern.13": "",
  "column.14": "cause",
  "title.14": "Cause",
  "type.14": "string",
  "format.14": "default",
  "description.14": "Cause of mortality as reported by the original source.",
  "pattern.14": "",
  "column.15": "cause_family",
  "title.15": "Cause Family",
  "type.15": "string",
  "format.15": "default",
  "description.15": "Cause family as reported by the original source.",
  "pattern.15": "",
  "column.16": "christened",
  "title.16": "Christened",
  "type.16": "string",
  "format.16": "num_missing",
  "description.16": "Number of christened individuals reported for this period as reported by the original source.",
  "pattern.16": "",
  "column.17": "comment",
  "title.17": "Comment",
  "type.17": "string",
  "format.17": "default",
  "description.17": "Comments associated with a particular record.",
  "pattern.17": "",
  "column.18": "comment_by",
  "title.18": "Comment By",
  "type.18": "string",
  "format.18": "default",
  "description.18": "The individual, data processor role, or organization responsible for the comment.",
  "pattern.18": "",
  "column.19": "dataset_id",
  "title.19": "IIDDA Dataset ID",
  "type.19": "string",
  "format.19": "default",
  "description.19": "Unique identifier of the dataset in the International Infectious Disease Data Archive (IIDDA) on which each record is based.",
  "pattern.19": "",
  "column.20": "date",
  "title.20": "Date",
  "type.20": "date",
  "format.20": "ISO8601",
  "description.20": "Date of time point at which a value is reported, in ISO-8601 format (i.e. YYYY-MM-DD).",
  "pattern.20": "",
  "column.21": "days_this_period",
  "title.21": "Days this Period",
  "type.21": "string",
  "format.21": "num_missing",
  "description.21": "Number of days in a time interval for which a count was reported.",
  "pattern.21": "",
  "column.22": "deaths",
  "title.22": "Deaths",
  "type.22": "string",
  "format.22": "num_missing",
  "description.22": "Number of deaths reported for this period as reported by the original source.",
  "pattern.22": "",
  "column.23": "default_grouping_scheme",
  "title.23": "Default Grouping Scheme",
  "type.23": "string",
  "format.23": "default",
  "description.23": "An indicator that equals Default if this age group is part of the default age grouping scheme, and is blank otherwise. This is useful if multiple age grouping schemes exist for some breakdowns of the data. In the ideal situation it is possible to filter on the default binning scheme, group by any other breakdown variables, and summing up a numerical variable, one will obtain the total of that variable over the entire population. However, this ideal is not always possible.",
  "pattern.23": "",
  "column.24": "diagnosis_certainty",
  "title.24": "Diagnosis Certainty",
  "type.24": "string",
  "format.24": "default",
  "description.24": "Diagnosis certainty of cases_this_period, either confirmed, probable, or suspect c (suspect case).",
  "pattern.24": "",
  "column.25": "disease",
  "title.25": "Disease",
  "type.25": "string",
  "format.25": "default",
  "description.25": "Disease name harmonized over data sources.",
  "pattern.25": "",
  "column.26": "historical_age_group",
  "title.26": "Historical Age Group",
  "type.26": "string",
  "format.26": "default",
  "description.26": "Age group descriptor as reported or implied in the original source. If an age group represents all ages then one will typically find the string -- All ages. When combining datasets with and without age groupings, one should filter on this string and a blank string to obtain all reported totals that are not broken down by age. The blank string indicates that there are no available age breakdowns of this total whereas the -- All ages -- string indicates that there are reported breakdowns of this total.\t",
  "pattern.26": "",
  "column.27": "historical_disease",
  "title.27": "Historical Disease",
  "type.27": "string",
  "format.27": "default",
  "description.27": "Disease name as reported by the original source.",
  "pattern.27": "",
  "column.28": "historical_disease_family",
  "title.28": "Historical Disease Family",
  "type.28": "string",
  "format.28": "default",
  "description.28": "Disease family as reported by the original source.",
  "pattern.28": "",
  "column.29": "historical_disease_subclass",
  "title.29": "Historical Disease Subclass",
  "type.29": "string",
  "format.29": "default",
  "description.29": "Disease subclass as reported by the original source -- cf. Disease",
  "pattern.29": "",
  "column.30": "icd_7",
  "title.30": "ICD 7 Code",
  "type.30": "string",
  "format.30": "default",
  "description.30": "Disease codes for version 7 of the International Statistical Classification of Diseases and Related Health Problems, published by the World Health Organization.",
  "pattern.30": "([A-z]*[0-9]+\\.*[A-z]*[0-9]*[,\\- ]*)+",
  "column.31": "icd_7_subclass",
  "title.31": "ICD 7 Code for Disease Subclass",
  "type.31": "string",
  "format.31": "default",
  "description.31": "Disease codes associated with a subclass identified by the original source. Codes are for version 7 of the International Statistical Classification of Diseases and Related Health Problems, published by the World Health Organization.",
  "pattern.31": "",
  "column.32": "icd_9",
  "title.32": "ICD 9 Code",
  "type.32": "string",
  "format.32": "default",
  "description.32": "Disease codes for version 9 of the International Statistical Classification of Diseases and Related Health Problems, published by the World Health Organization.",
  "pattern.32": "",
  "column.33": "icd_9_subclass",
  "title.33": "ICD 9 Code for Disease Subclass",
  "type.33": "string",
  "format.33": "default",
  "description.33": "Disease codes associated with a subclass identified by the original source. Codes are for version 9 of the International Statistical Classification of Diseases and Related Health Problems, published by the World Health Organization.",
  "pattern.33": "",
  "column.34": "iidda_source_id",
  "title.34": "IIDDA Source ID",
  "type.34": "string",
  "format.34": "default",
  "description.34": "Unique identifier of the data source in the International Infectious Disease Data Archive (IIDDA) on which each record is based.",
  "pattern.34": "",
  "column.35": "infected_parishes",
  "title.35": "Infected Parishes",
  "type.35": "string",
  "format.35": "num_missing",
  "description.35": "Number of parishes infected with the plague for this period as reported by the original source.",
  "pattern.35": "",
  "column.36": "iso_3166",
  "title.36": "ISO-3166",
  "type.36": "string",
  "format.36": "default",
  "description.36": "ISO-3166 codes for locations corresponding to countries.",
  "pattern.36": "",
  "column.37": "iso_3166_2",
  "title.37": "ISO-3166-2",
  "type.37": "string",
  "format.37": "default",
  "description.37": "ISO-3166-2 codes for locations corresponding to sub-national jurisdictions.",
  "pattern.37": "",
  "column.38": "location",
  "title.38": "Location",
  "type.38": "string",
  "format.38": "default",
  "description.38": "Location descriptor as reported in the original source.",
  "pattern.38": "",
  "column.39": "location_type",
  "title.39": "Location Type",
  "type.39": "string",
  "format.39": "default",
  "description.39": "Location type of recorded data (continents, countries, canadian-provinces, canadian-cities, ontario-cities, uk-cities, london-parishes) for a given record.",
  "pattern.39": "",
  "column.40": "lower_age",
  "title.40": "Lower Age Bound",
  "type.40": "string",
  "format.40": "num_missing",
  "description.40": "Lower age bound in years of all individuals associated with a particular record.",
  "pattern.40": "",
  "column.41": "nesting_age_group",
  "title.41": "Nesting Age Group",
  "type.41": "string",
  "format.41": "default",
  "description.41": "Age descriptor of an age group that contains all of the ages in this group. If multiple groups contain this group, then a group of minimum bin-width is chosen. Not all age groups have a nesting age group.",
  "pattern.41": "",
  "column.42": "nesting_cause",
  "title.42": "Nesting Cause",
  "type.42": "string",
  "format.42": "default",
  "description.42": "Cause descriptor for a group of causes of mortality that includes this cause.",
  "pattern.42": "",
  "column.43": "nesting_disease",
  "title.43": "Nesting Disease",
  "type.43": "string",
  "format.43": "default",
  "description.43": "Disease name that encapsulates this disease in a hierarchy of diseases.",
  "pattern.43": "",
  "column.44": "nesting_location",
  "title.44": "Nesting Location",
  "type.44": "string",
  "format.44": "default",
  "description.44": "Location descriptor for a location that geographically encapsulates this location.",
  "pattern.44": "",
  "column.45": "nesting_sex",
  "title.45": "Nesting Sex",
  "type.45": "string",
  "format.45": "default",
  "description.45": "Sex decriptor for a sex categorization that contains this sex.",
  "pattern.45": "",
  "column.46": "not_infected_parishes",
  "title.46": "Not Infected Parishes",
  "type.46": "string",
  "format.46": "num_missing",
  "description.46": "Number of parishes not infected with the plague for this period as reported by the original source.",
  "pattern.46": "",
  "column.47": "original_dataset_id",
  "title.47": "IIDDA Original Dataset ID",
  "type.47": "string",
  "format.47": "default",
  "description.47": "Identifies the original dataset of a record before it was harmonized.",
  "pattern.47": "",
  "column.48": "period_end_date",
  "title.48": "Period End Date",
  "type.48": "date",
  "format.48": "ISO8601",
  "description.48": "The last date within the time interval for which a count was reported, in ISO-8601 format (i.e. YYYY-MM-DD).",
  "pattern.48": "",
  "column.49": "period_mid_date",
  "title.49": "Period Mid Date",
  "type.49": "date",
  "format.49": "ISO8601",
  "description.49": "Date in the (rounded down) middle of a time interval for which a count was reported, in ISO-8601 format (i.e. YYYY-MM-DD).",
  "pattern.49": "",
  "column.50": "period_start_date",
  "title.50": "Period Start Date",
  "type.50": "date",
  "format.50": "ISO8601",
  "description.50": "The first date within the time interval for which a count was reported, in ISO-8601 format (i.e. YYYY-MM-DD).",
  "pattern.50": "",
  "column.51": "population",
  "title.51": "Population",
  "type.51": "string",
  "format.51": "num_missing",
  "description.51": "Estimated total number of individuals associated with a particular record.",
  "pattern.51": "",
  "column.52": "population_reporting",
  "title.52": "Population Reporting",
  "type.52": "string",
  "format.52": "num_missing",
  "description.52": "Estimated total number of individuals associated with a case report. For example, if a case count is reported for a country (e.g. Canada) but only certain jurisdictions within that country (e.g. provinces) have contributed data, then the population_reported is the sum of the populations of the contributing jurisdictions. This field can be useful for normalizing by population size in instances when the total population is not representative of the count.",
  "pattern.52": "",
  "column.53": "record_origin",
  "title.53": "Record Origin",
  "type.53": "string",
  "format.53": "default",
  "description.53": "String describing where each record came from (e.g. historical indicates that it was recorded in a document or archive)",
  "pattern.53": "",
  "column.54": "sex",
  "title.54": "Sex",
  "type.54": "string",
  "format.54": "default",
  "description.54": "Sex of all individuals associated with a particular record as reported by the original source.",
  "pattern.54": "",
  "column.55": "time_scale",
  "title.55": "Time Scale",
  "type.55": "string",
  "format.55": "default",
  "description.55": "Time scale of recorded data (wk, 2wk, mo, qr, yr) for a given record. This field is a qualitative and approximate measure of the time scale over which data were counted. For example, monthly (mo) data might include four-weekly or even five-weekly data. See columns like days_this_period for a quantitative description of the time scale if it is available, or produce your own description using period_start_date and period_end_date.",
  "pattern.55": "",
  "column.56": "upper_age",
  "title.56": "Upper Age Bound",
  "type.56": "string",
  "format.56": "num_missing",
  "description.56": "Upper age bound in years of all individuals associated with a particular record.",
  "pattern.56": "",
  "column.57": "year",
  "title.57": "Year",
  "type.57": "string",
  "format.57": "num_missing",
  "description.57": "Year in which a count was reported.",
  "pattern.57": ""
}
