[
  {
    "name": "location",
    "title": "Location",
    "type": "string",
    "format": "default",
    "description": "Location descriptor as reported in the original source.",
    "pattern": ""
  },
  {
    "name": "iso_3166",
    "title": "ISO-3166",
    "type": "string",
    "format": "default",
    "description": "ISO-3166 codes for locations corresponding to countries.",
    "pattern": ""
  },
  {
    "name": "iso_3166_2",
    "title": "ISO-3166-2",
    "type": "string",
    "format": "default",
    "description": "ISO-3166-2 codes for locations corresponding to sub-national jurisdictions.",
    "pattern": ""
  },
  {
    "name": "date",
    "title": "Date",
    "type": "date",
    "format": "ISO8601",
    "description": "Date of time point at which a value is reported, in ISO-8601 format (i.e. YYYY-MM-DD).",
    "pattern": ""
  },
  {
    "name": "period_start_date",
    "title": "Period Start Date",
    "type": "date",
    "format": "ISO8601",
    "description": "Start date of time interval for which a count was reported, in ISO-8601 format (i.e. YYYY-MM-DD).",
    "pattern": ""
  },
  {
    "name": "period_end_date",
    "title": "Period End Date",
    "type": "date",
    "format": "ISO8601",
    "description": "End date of time interval for which a count was reported, in ISO-8601 format (i.e. YYYY-MM-DD).",
    "pattern": ""
  },
  {
    "name": "disease_family",
    "title": "Disease Family",
    "type": "string",
    "format": "default",
    "description": "Disease family as reported by the original source.",
    "pattern": ""
  },
  {
    "name": "disease",
    "title": "Disease",
    "type": "string",
    "format": "default",
    "description": "Disease name as reported by the original source.",
    "pattern": ""
  },
  {
    "name": "icd_9",
    "title": "ICD 9 Code",
    "type": "string",
    "format": "default",
    "description": "Disease codes for version 9 of the International Statistical Classification of Diseases and Related Health Problems, published by the World Health Organization.",
    "pattern": ""
  },
  {
    "name": "icd_7",
    "title": "ICD 7 Code",
    "type": "string",
    "format": "default",
    "description": "Disease codes for version 7 of the International Statistical Classification of Diseases and Related Health Problems, published by the World Health Organization.",
    "pattern": "([A-z]*[0-9]+\\.*[A-z]*[0-9]*[,\\- ]*)+"
  },
  {
    "name": "disease_subclass",
    "title": "Disease Subclass",
    "type": "string",
    "format": "default",
    "description": "Disease subclass as reported by the original source -- cf. Disease",
    "pattern": ""
  },
  {
    "name": "icd_9_subclass",
    "title": "ICD 9 Code for Disease Subclass",
    "type": "string",
    "format": "default",
    "description": "Disease codes associated with a subclass identified by the original source. Codes are for version 9 of the International Statistical Classification of Diseases and Related Health Problems, published by the World Health Organization.",
    "pattern": ""
  },
  {
    "name": "icd_7_subclass",
    "title": "ICD 7 Code for Disease Subclass",
    "type": "string",
    "format": "default",
    "description": "Disease codes associated with a subclass identified by the original source. Codes are for version 7 of the International Statistical Classification of Diseases and Related Health Problems, published by the World Health Organization.",
    "pattern": ""
  },
  {
    "name": "lower_age",
    "title": "Lower Age Bound",
    "type": "string",
    "format": "num_missing",
    "description": "Lower age bound in years of all individuals associated with a particular record.",
    "pattern": ""
  },
  {
    "name": "upper_age",
    "title": "Upper Age Bound",
    "type": "string",
    "format": "num_missing",
    "description": "Upper age bound in years of all individuals associated with a particular record.",
    "pattern": ""
  },
  {
    "name": "sex",
    "title": "Sex",
    "type": "string",
    "format": "default",
    "description": "Sex of all individuals associated with a particular record as reported by the original source.",
    "pattern": ""
  },
  {
    "name": "cases_this_period",
    "title": "Case Numbers Reported for this Period",
    "type": "string",
    "format": "num_missing",
    "description": "Number of cases reported for this period, at the end of this period -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
    "pattern": ""
  },
  {
    "name": "cases_prev_period",
    "title": "Case Numbers Reported for the Previous Period",
    "type": "string",
    "format": "num_missing",
    "description": "Number of cases reported for the previous period, at the end of this current period -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
    "pattern": ""
  },
  {
    "name": "cases_cum_report_year",
    "title": "Cumulative Case Numbers for the Report Year",
    "type": "string",
    "format": "num_missing",
    "description": "Total number of cases up until this current period, in the current year -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
    "pattern": ""
  },
  {
    "name": "cases_cum_prev_year",
    "title": "Cumulative Case Numbers for the Previous Year",
    "type": "string",
    "format": "num_missing",
    "description": "Total number of cases up until this current period, in the previous year -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
    "pattern": ""
  },
  {
    "name": "cases_median_prev_5_years",
    "title": "Median Weekly Case Numbers Over the Previous Five Years",
    "type": "string",
    "format": "num_missing",
    "description": "Median number of weekly cases in this current period, with the median taken over the previous five years -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
    "pattern": ""
  },
  {
    "name": "cases_cum_median_prev_5_years",
    "title": "Median Cumulative Case Numbers Over the Previous Five Years",
    "type": "string",
    "format": "num_missing",
    "description": "Median number of cumulative cases by this current period, with the median taken over the previous five years -- as reported by the original source. Includes different types of missing values as reported by the original source. Type \"string\" allows different types of missing values to be specified as reported by the original source and allows users to choose which type of missing values to work with.",
    "pattern": ""
  },
  {
    "name": "population",
    "title": "Population",
    "type": "string",
    "format": "num_missing",
    "description": "Estimated total number of individuals associated with a particular record.",
    "pattern": ""
  },
  {
    "name": "cause",
    "title": "Cause",
    "type": "string",
    "format": "default",
    "description": "Cause of mortality as reported by the original source.",
    "pattern": ""
  },
  {
    "name": "time_scale",
    "title": "Time Scale",
    "type": "string",
    "format": "default",
    "description": "Time scale of recorded data (wk, mt, qrtr, yr) for a given record.",
    "pattern": ""
  },
  {
    "name": "location_type",
    "title": "Location Type",
    "type": "string",
    "format": "default",
    "description": "Location type of recorded data (continents, countries, canadian-provinces, canadian-cities, ontario-cities, uk-cities, london-parishes) for a given record.",
    "pattern": ""
  },
  {
    "name": "comment",
    "title": "Comment",
    "type": "string",
    "format": "default",
    "description": "Comments associated with a particular record.",
    "pattern": ""
  },
  {
    "name": "comment_by",
    "title": "Comment By",
    "type": "string",
    "format": "default",
    "description": "The individual, data processor role, or organization responsible for the comment.",
    "pattern": ""
  },
  {
    "name": "cause_family",
    "title": "Cause Family",
    "type": "string",
    "format": "default",
    "description": "Cause family as reported by the original source. ",
    "pattern": ""
  },
  {
    "name": "births",
    "title": "Births",
    "type": "string",
    "format": "num_missing",
    "description": "Number of births reported for this period as reported by the original source.",
    "pattern": ""
  },
  {
    "name": "christened",
    "title": "Christened",
    "type": "string",
    "format": "num_missing",
    "description": "Number of christened individuals reported for this period as reported by the original source.",
    "pattern": ""
  },
  {
    "name": "deaths",
    "title": "Deaths",
    "type": "string",
    "format": "num_missing",
    "description": "Number of deaths reported for this period as reported by the original source.",
    "pattern": ""
  },
  {
    "name": "burials",
    "title": "Burials",
    "type": "string",
    "format": "num_missing",
    "description": "Number of burials reported for this period as reported by the original source.",
    "pattern": ""
  },
  {
    "name": "infected_parishes",
    "title": "Infected Parishes",
    "type": "string",
    "format": "num_missing",
    "description": "Number of parishes infected with the plague for this period as reported by the original source. ",
    "pattern": ""
  },
  {
    "name": "not_infected_parishes",
    "title": "Not Infected Parishes",
    "type": "string",
    "format": "num_missing",
    "description": "Number of parishes not infected with the plague for this period as reported by the original source. \t",
    "pattern": ""
  }
]
